[
    {
        "image": "Lesson1.png",
        "educationalMaterial": "A music lesson typically begins with warm-ups, such as scales or rhythm exercises, to develop technique. The instructor then reviews previous material and introduces new concepts, such as chords, sight-reading, or music theory. Students practice pieces suited to their skill level, receiving feedback on tone, timing, and expression.",
        "completed": true,
        "id": "e8810e9c-9eed-4ee3-8c14-fc22a5bfc289",
        "title": "Lesson 1",
        "visualAid": "VisualAid1.png"
    },
    {
        "image": "Lesson2.png",
        "educationalMaterial": "Depending on the instrument, lessons may focus on finger positioning, breath control, or bowing techniques. Ear training and improvisation can also be included. Regular practice is essential for progress. The lesson ends with a summary of key points and assignments for the next session, helping students refine their musical abilities.",
        "completed": true,
        "id": "c09443ad-877e-4e4d-abd4-65d9e9dd1dee",
        "title": "Lesson 2",
        "visualAid": "VisualAid2.png"
    },
    {
        "image": "Lesson3.png",
        "educationalMaterial": "A music lesson is a structured session where students develop their musical skills through guided instruction. It often begins with warm-up exercises, such as scales, rhythm drills, or vocal warm-ups, to improve technique and dexterity.",
        "completed": true,
        "id": "9586960f-1bf0-465c-97c4-a1a980b7b52f",
        "title": "Lesson 3",
        "visualAid": "VisualAid3.png"
    },
    {
        "image": "Lesson4.png",
        "educationalMaterial": "This session introduces intervals and ear training. Students practice identifying intervals by sound and learning how they relate to harmony and melody.",
        "completed": false,
        "id": "89477af4-ea27-4939-87c3-d6076df750d4",
        "title": "Lesson 4",
        "visualAid": "VisualAid4.png"
    },
    {
        "image": "Lesson5.png",
        "educationalMaterial": "Students explore dynamics and articulation. Exercises include playing passages with different dynamics and using articulation marks such as staccato and legato.",
        "completed": false,
        "id": "a99e1e36-5182-4ac3-91de-e0c34b70f3d2",
        "title": "Lesson 5",
        "visualAid": "VisualAid5.png"
    },
    {
        "image": "Lesson6.png",
        "educationalMaterial": "Introduction to chord progressions and harmony. Students play simple chord sequences and analyze how chords function within a key.",
        "completed": false,
        "id": "1a2b3c4d-5e6f-7a8b-9c0d-1e2f3a4b5c6d",
        "title": "Lesson 6",
        "visualAid": "VisualAid6.png"
    },
    {
        "image": "Lesson7.png",
        "educationalMaterial": "This lesson covers sight-reading basics. Students learn strategies for quickly interpreting rhythms and pitches in new pieces.",
        "completed": false,
        "id": "56fa69c3-d95f-45ec-9f3a-67191d25bfb0",
        "title": "Lesson 7",
        "visualAid": "VisualAid7.png"
    },
    {
        "image": "Lesson8.png",
        "educationalMaterial": "Students are introduced to minor scales and how they differ from major scales. Practice includes identifying and playing natural, harmonic, and melodic minor scales.",
        "completed": false,
        "id": "c0d9f8a6-b82d-4c72-b7a5-6c1b1b44df89",
        "title": "Lesson 8",
        "visualAid": "VisualAid8.png"
    },
    {
        "image": "Lesson9.png",
        "educationalMaterial": "Focus on musical phrasing and expression. Students analyze short pieces to identify phrase structures and practice expressive playing.",
        "completed": false,
        "id": "bc123a2d-88f2-4fd9-a0a9-752b4d9450f1",
        "title": "Lesson 9",
        "visualAid": "VisualAid9.png"
    },
    {
        "image": "Lesson10.png",
        "educationalMaterial": "In this lesson, students work on ensemble playing. Emphasis is placed on listening to others, keeping time together, and balancing parts in group music.",
        "completed": false,
        "id": "d45cfcb4-5f8b-4268-8d44-3d7e7b2ab8cd",
        "title": "Lesson 10",
        "visualAid": "VisualAid10.png"
    },
    {
        "image": "Lesson11.png",
        "educationalMaterial": "Students are introduced to musical form and structure. Lessons cover common forms like binary, ternary, and rondo, using real music examples.",
        "completed": false,
        "id": "9ab12da0-1947-4d8b-844f-1878ffbceea5",
        "title": "Lesson 11",
        "visualAid": "VisualAid11.png"
    },
    {
        "image": "Lesson12.png",
        "educationalMaterial": "Review of all major concepts covered so far. Students complete a performance piece integrating rhythm, melody, harmony, and expressive techniques.",
        "completed": false,
        "id": "d0e1f2c3-b4a5-6d7e-8f9a-0b1c2d3e4f5a",
        "title": "Lesson 12",
        "visualAid": "VisualAid12.png"
    }
]